export const EQUIPMENT_TYPES = [
  'Кран',
  'Кран-балка электрическая',
  'Кран-балка ручная',
  'Монорельс с электрической талью',
  'Кран консольный-поворотный',
  'Подъемник',
  'Лифт',
  'Эскалатор',
  'Другое',
] as const

export type EquipmentType = (typeof EQUIPMENT_TYPES)[number]

/** Типы, относящиеся к кранам (для иконок) */
export const CRANE_TYPES = [
  'Кран',
  'Кран-балка электрическая',
  'Кран-балка ручная',
  'Монорельс с электрической талью',
  'Кран консольный-поворотный',
] as const
